Autodesk.Revit.DB.OrdinateDimensionLineStyle.Segmented
the segmented ordinate dimension line style

Autodesk.Revit.DB.OrdinateDimensionLineStyle.Continuous
the continuous ordinate dimension line style

Autodesk.Revit.DB.OrdinateDimensionLineStyle.None
the invalid ordinate dimension line style